{
  "tracks": [
    {
      "id": "web-dev",
      "name": "Web Dev",
      "icon": "FaLaptopCode", 
      "description": "Build and ship working full stack tools using modern web technologies like React, Express, and Supabase.",
      "modules": [
        { "id": 1, "week": "Week 1", "title": "Fast Recap", "project": "Ship a public portfolio or landing page", "icon": "FaRocket", "description": "Recap HTML, CSS, and JS basics. Learn to structure content and styles to build and deploy a professional static website that introduces you or an idea." },
        { "id": 2, "week": "Week 2", "title": "React & Interactive UI", "project": "Build a client-side tool", "icon": "FaReact", "description": "Master React components, props, and state. Solve a problem by building a dynamic, single-page tool like a custom dashboard, timer, or note app." },
        { "id": 3, "week": "Week 3", "title": "Express.js & APIs", "project": "Design and build a REST API", "icon": "FaServer", "description": "Understand the backend. Use Express.js to create routes and middleware, building an API that returns useful data for any frontend application." },
        { "id": 4, "week": "Week 4", "title": "Databases & Authentication", "project": "Create a full stack CRUD app", "icon": "FaDatabase", "description": "Manage data and users. Integrate Supabase to add a database and user authentication, building an app that can create, read, update, and delete data." },
        { "id": 5, "week": "Week 5", "title": "Full Stack Integration", "project": "Deploy your best tool yet", "icon": "FaCloudUploadAlt", "description": "Connect the frontend and backend to build a polished, fully-functional web application. Focus on a great user experience and deploy it publicly." },
        { "id": 6, "week": "Weeks 6-7", "title": "Final Project Launch", "project": "Ship a full, real-world product", "icon": "FaTrophy", "description": "Work in a team to build a complete product that solves a real problem. Prepare for a public launch on platforms like Product Hunt or DevPost." }
      ]
    },
    {
      "id": "coding-fundamentals",
      "name": "Fundamentals", 
      "icon": "FaCode", 
      "description": "Ship open source tools, CLI apps, bots, and backend services that developers and users will love.",
      "modules": [
        { "id": 1, "week": "Week 1", "title": "Scripting & CLI Tools", "project": "Build a simple command-line tool", "icon": "FaTools", "description": "Go beyond basic scripts. Build a useful command-line tool that solves a problem for you or other developers, like a file organizer or code generator." },
        { "id": 2, "week": "Week 2", "title": "APIs & HTTP Requests", "project": "Create a bot or automation", "icon": "FaCogs", "description": "Connect your code to the world. Use an external API to build a bot for a platform like Discord or a script that automates a repetitive task." },
        { "id": 3, "week": "Week 3", "title": "Web Scraping & File Ops", "project": "Build a data collection script", "icon": "FaProjectDiagram", "description": "Extract valuable information from the web. Write a robust script that scrapes a website, collects the data, and organizes it into a useful format like CSV or JSON." },
        { "id": 4, "week": "Week 4", "title": "Backend Services with Flask/FastAPI", "project": "Create a microservice or personal API", "icon": "FaPlug", "description": "Build lightweight backends. Use a Python framework to create your own API that can power a website, serve data, or run a specific task." },
        { "id": 5, "week": "Week 5", "title": "Packaging & Open Source", "project": "Publish a developer tool or library", "icon": "FaCloudUploadAlt", "description": "Contribute to the community. Package one of your tools for easy distribution and publish it as an open-source project on GitHub with a high-quality README." },
        { "id": 6, "week": "Weeks 6-7", "title": "Final Project Launch", "project": "Ship a useful tool with a public repo", "icon": "FaTrophy", "description": "Create a high-impact developer tool or automation. Focus on usefulness, code quality, and clear documentation for a public GitHub launch." }
      ]
    },
    {
      "id": "data-science",
      "name": "Data Science",
      "icon": "FaChartBar", 
      "description": "Go beyond the numbers. Analyze real-world data, uncover meaningful insights, and tell compelling stories with visualizations.",
      "modules": [
        { "id": 1, "week": "Week 1", "title": "Jupyter & Basic EDA", "project": "Perform an exploratory data analysis", "icon": "FaLightbulb", "description": "Learn the tools of the trade. Use Python and Jupyter Notebooks to conduct a basic exploratory data analysis (EDA) on a provided dataset to find initial patterns." },
        { "id": 2, "week": "Week 2", "title": "Pandas & NumPy", "project": "Publish a data analysis report", "icon": "FaVial", "description": "Master data manipulation. Use pandas and numpy to clean, transform, and analyze a real dataset, then present your findings in a public notebook." },
        { "id": 3, "week": "Week 3", "title": "Data Visualization", "project": "Create a visual data story", "icon": "FaChartBar", "description": "Tell a story with data. Use libraries like Matplotlib or Plotly to create compelling charts and graphs that make a complex topic easy to understand." },
        { "id": 4, "week": "Week 4", "title": "Real-World Datasets", "project": "Produce a cleaned dataset & insight report", "icon": "FaTools", "description": "Tackle messy data. Source a dataset from Kaggle or an API, perform a rigorous cleaning process, and publish both the clean data and an insights report." },
        { "id": 5, "week": "Week 5", "title": "Streamlit & Dashboards", "project": "Build an interactive data dashboard", "icon": "FaStore", "description": "Bring your analysis to life. Use Streamlit to turn your data notebook into an interactive web app or dashboard that users can explore." },
        { "id": 6, "week": "Weeks 6-7", "title": "Final Project Launch", "project": "Publish a final Kaggle notebook or Streamlit app", "icon": "FaTrophy", "description": "Solve a real problem with data. Conduct a comprehensive analysis to uncover a meaningful insight and publish your work for the community to see and use." }
      ]
    }
  ]
}